In [34]:
import pandas as pd

# convert a list to a pandas series

In [35]:
li = [2,4,6,8]

In [36]:
pd.Series(li)

0    2
1    4
2    6
3    8
dtype: int64

# pandas Series with the index

In [37]:
li = [1,2,3,4,5,6,7,5]
ind = ['a','b','k','d','e','r','r','b']
pd.Series(li,index=ind)

a    1
b    2
k    3
d    4
e    5
r    6
r    7
b    5
dtype: int64

# the first element is values and index will be the list.

In [38]:
s = pd.Series(ind, index=li)

In [39]:
s

1    a
2    b
3    k
4    d
5    e
6    r
7    r
5    b
dtype: object

# slicing the pandas series

In [40]:
s[1:]

2    b
3    k
4    d
5    e
6    r
7    r
5    b
dtype: object

In [41]:
s

1    a
2    b
3    k
4    d
5    e
6    r
7    r
5    b
dtype: object

In [42]:
ser = pd.Series(li,index=ind)
ser

a    1
b    2
k    3
d    4
e    5
r    6
r    7
b    5
dtype: int64

# indexing through the key value

In [43]:
ser['a']

1

# indexing through a number

In [44]:
ser[0]

1

In [45]:
ser['b']

b    2
b    5
dtype: int64

# getting the head of the series

In [46]:
ser = pd.Series([1,2,3,4,5,4,6,7,8,9,0])

In [47]:
ser.head() # returns the first 5 elements

0    1
1    2
2    3
3    4
4    5
dtype: int64

# creating the series using the numpy arrays

In [48]:
import numpy as np 
arr = np.arange(0,12,1)
ser = pd.Series(arr)
ser.head()

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [49]:
ser.tail()

7      7
8      8
9      9
10    10
11    11
dtype: int32

In [50]:
ser.head()

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [51]:
ser.tail(3)

9      9
10    10
11    11
dtype: int32

# location in series

In [52]:
ser.loc[3]

3

# integer location in series

In [53]:
ser.iloc[3]

3

In [54]:
ser.loc[3:7]

3    3
4    4
5    5
6    6
7    7
dtype: int32

# type of the series

In [55]:
type(ser)

pandas.core.series.Series

# fequency in a series

In [56]:
ser4 = pd.Series(['India','US','India','China','India'])
ser4

0    India
1       US
2    India
3    China
4    India
dtype: object

In [57]:
ser4.value_counts()

India    3
US       1
China    1
dtype: int64

# finding the unique values in the series

In [58]:
ser4.unique()

array(['India', 'US', 'China'], dtype=object)

# finding number of unique elements in the series

In [59]:
ser4.nunique() # there are three unique numbers present in the series

3

# max and min in series

In [60]:
ser4.min()

'China'

In [61]:
ser4.max()

'US'

# index of max or min in the series

In [62]:
ser

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
dtype: int32

In [63]:
ser.idxmax() # index for the minimum value

11

In [64]:
ser.idxmin() # index for the maximum value

0

# argmax and arg min are not allowed for object data type

In [65]:
ser4.argmax()

TypeError: reduction operation 'argmax' not allowed for this dtype

In [66]:
ser4.argmin()

TypeError: reduction operation 'argmin' not allowed for this dtype

In [67]:
ser = pd.Series(np.arange(0,4),index=['a','b','c','d'])

In [68]:
ser['c']

2

In [69]:
ser.loc['c']

2

In [70]:
# iloc only works on the integer index

In [71]:
ser.iloc['c']

TypeError: Cannot index by location index with a non-integer key

# convert the elements of the series to a list

In [72]:
ser4.tolist()

['India', 'US', 'India', 'China', 'India']

# dictonary to pandas series

In [73]:
data = {'A1':'India','A2':'China','A3':'US','A4':'Chile'}

In [74]:
pd.DataFrame(data.items())

    0      1
0  A1  India
1  A2  China
2  A3     US
3  A4  Chile

# numpy arrays to dataframe

In [75]:
df = pd.DataFrame(np.arange(0,50,3)) # numpy array to a dataframe

In [76]:
type(df)

pandas.core.frame.DataFrame

# converting from a list to a dataframe

In [77]:
df1 = pd.DataFrame(['India','US','India','China','India'])

In [78]:
df1

       0
0  India
1     US
2  India
3  China
4  India

In [79]:
df1['new'] = np.arange(0,5)

In [80]:
df1[['new1','new2']] = 12,12

# reading dataframe in jupyter notebook

In [81]:
df = pd.read_csv(r'dm.csv')

In [82]:
type(df)

pandas.core.frame.DataFrame

In [83]:
df.head()

,Age,Gender,OwnHome,Married,Location,Salary,Children,History,Catalogs,AmountSpent,Cust_Id
0,Old,Female,Own,Single,Far,47500,0,High,6,755,247
1,Middle,Male,Rent,Single,Close,63600,0,High,6,1318,127
2,Young,Female,Rent,Single,Close,13500,0,Low,18,296,479
3,Middle,Male,Own,Married,Close,85600,1,High,18,2436,475
4,Middle,Female,Own,Single,Close,68400,0,High,12,1304,151

In [84]:
df.tail()

,Age,Gender,OwnHome,Married,Location,Salary,Children,History,Catalogs,AmountSpent,Cust_Id
995,Young,Female,Rent,Single,Close,19400,1,NaN,18,384,190
996,Middle,Male,Rent,Single,Far,40500,1,NaN,18,1073,510
997,Old,Male,Own,Single,Close,44800,0,Medium,24,1417,725
998,Middle,Male,Own,Married,Close,79000,2,Medium,18,671,1034
999,Young,Male,Rent,Married,Close,53600,1,Medium,24,973,1203

# getting the columns of the dataframe

In [85]:
df.columns

Index(['Age', 'Gender', 'OwnHome', 'Married', 'Location', 'Salary', 'Children',
       'History', 'Catalogs', 'AmountSpent', 'Cust_Id'],
      dtype='object')

In [86]:
df.index

RangeIndex(start=0, stop=1000, step=1)

In [87]:
df

,Age,Gender,OwnHome,Married,Location,Salary,Children,History,Catalogs,AmountSpent,Cust_Id
0,Old,Female,Own,Single,Far,47500,0,High,6,755,247
1,Middle,Male,Rent,Single,Close,63600,0,High,6,1318,127
2,Young,Female,Rent,Single,Close,13500,0,Low,18,296,479
3,Middle,Male,Own,Married,Close,85600,1,High,18,2436,475
4,Middle,Female,Own,Single,Close,68400,0,High,12,1304,151
...,...,...,...,...,...,...,...,...,...,...,...
995,Young,Female,Rent,Single,Close,19400,1,NaN,18,384,190
996,Middle,Male,Rent,Single,Far,40500,1,NaN,18,1073,510
997,Old,Male,Own,Single,Close,44800,0,Medium,24,1417,725
998,Middle,Male,Own,Married,Close,79000,2,Medium,18,671,1034
999,Young,Male,Rent,Married,Close,53600,1,Medium,24,973,1203

In [88]:
df.shape

(1000, 11)

# Select only one row from the data frame

In [91]:
df['Age'] # each and every column of a dataframa is a series

0         Old
1      Middle
2       Young
3      Middle
4      Middle
        ...
995     Young
996    Middle
997       Old
998    Middle
999     Young
Name: Age, Length: 1000, dtype: object

In [92]:
type(df['Age'])

pandas.core.series.Series

In [93]:
isinstance(df['Age'],pd.Series)

True

# get two columns

In [101]:
df[['Gender','Salary']] # to get multiple columns we pass the column names as lists

# multiple columns returns dataframes

     Gender  Salary
0    Female   47500
1      Male   63600
2    Female   13500
3      Male   85600
4    Female   68400
..      ...     ...
995  Female   19400
996    Male   40500
997    Male   44800
998    Male   79000
999    Male   53600

[1000 rows x 2 columns]

In [102]:
type(df[['Gender','Salary']])

pandas.core.frame.DataFrame

In [103]:
isinstance(df[['Gender','Salary']],pd.DataFrame)

True

In [104]:
pd.DataFrame

pandas.core.frame.DataFrame

# get data columns and data types

In [107]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Age          1000 non-null   object
 1   Gender       1000 non-null   object
 2   OwnHome      1000 non-null   object
 3   Married      1000 non-null   object
 4   Location     1000 non-null   object
 5   Salary       1000 non-null   int64
 6   Children     1000 non-null   int64
 7   History      697 non-null    object
 8   Catalogs     1000 non-null   int64
 9   AmountSpent  1000 non-null   int64
 10  Cust_Id      1000 non-null   int64
dtypes: int64(5), object(6)
memory usage: 86.1+ KB

# describing the dataset

In [109]:
df.describe() # only get the output for categorical columns

              Salary    Children     Catalogs  AmountSpent      Cust_Id
count    1000.000000  1000.00000  1000.000000  1000.000000  1000.000000
mean    56103.900000     0.93400    14.682000  1216.770000   643.930000
std     30616.314826     1.05107     6.622895   961.068613   369.047166
min     10100.000000     0.00000     6.000000    38.000000    12.000000
25%     29975.000000     0.00000     6.000000   488.250000   316.750000
50%     53700.000000     1.00000    12.000000   962.000000   636.000000
75%     77025.000000     2.00000    18.000000  1688.500000   955.500000
max    168800.000000     3.00000    24.000000  6217.000000  1297.000000

# to include all numeric and categorical data

In [111]:
df.describe(include='all')

,Age,Gender,OwnHome,Married,Location,Salary,Children,History,Catalogs,AmountSpent,Cust_Id
count,1000,1000,1000,1000,1000,1000.000000,1000.00000,697,1000.000000,1000.000000,1000.000000
unique,3,2,2,2,2,NaN,NaN,3,NaN,NaN,NaN
top,Middle,Female,Own,Married,Close,NaN,NaN,High,NaN,NaN,NaN
freq,508,506,516,502,710,NaN,NaN,255,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,56103.900000,0.93400,NaN,14.682000,1216.770000,643.930000
std,NaN,NaN,NaN,NaN,NaN,30616.314826,1.05107,NaN,6.622895,961.068613,369.047166
min,NaN,NaN,NaN,NaN,NaN,10100.000000,0.00000,NaN,6.000000,38.000000,12.000000
25%,NaN,NaN,NaN,NaN,NaN,29975.000000,0.00000,NaN,6.000000,488.250000,316.750000
50%,NaN,NaN,NaN,NaN,NaN,53700.000000,1.00000,NaN,12.000000,962.000000,636.000000
75%,NaN,NaN,NaN,NaN,NaN,77025.000000,2.00000,NaN,18.000000,1688.500000,955.500000
max,NaN,NaN,NaN,NaN,NaN,168800.000000,3.00000,NaN,24.000000,6217.000000,1297.000000

# describe the object datatype

In [113]:
# only describe the object datatype 
df.describe(include='O')
# this also describes the frequency of the top categorical element.

           Age  Gender OwnHome  Married Location History
count     1000    1000    1000     1000     1000     697
unique       3       2       2        2        2       3
top     Middle  Female     Own  Married    Close    High
freq       508     506     516      502      710     255

In [114]:
df.value_counts()

Age     Gender  OwnHome  Married  Location  Salary  Children  History  Catalogs  AmountSpent  Cust_Id
Middle  Female  Own      Married  Close     35300   0         Medium   24        1093         1033       1
Old     Female  Rent     Single   Far       15100   0         Low      6         348          726        1
                                  Close     28900   0         Low      12        830          1058       1
                                            29200   0         Low      12        556          1165       1
                                            33600   0         Medium   12        573          663        1
                                                                                                        ..
Middle  Male    Own      Married  Far       90700   3         High     24        2265         541        1
                                            93000   3         High     6         1046         523        1
                                            96800   2         High     18        2299         246        1
                                            100100  1         High     24        3491         162        1
Young   Male    Rent     Single   Far       25700   0         Medium   18        907          682        1
Length: 697, dtype: int64